let container2 = document.querySelector(".container2");

let btn1 = document.querySelector(".bextToinscript");
let intro = document.querySelector(".intro");
let inscri = document.querySelector(".cnt2");
btn1.addEventListener("click", () => {
    intro.classList.add('add_displayNONE')
    inscri.classList.add('add_display')
})



let pg_inscr = document.querySelector(".inscription")
let input_name_user = document.querySelector(".name_userinput")
let btnSTART = document.querySelector(".start1");


let pg_howto = document.querySelector(".hwoto")
let btnSTART2 = document.querySelector(".bda")
btnSTART2.disabled=false
btnSTART2.addEventListener('click', () => {
    btnSTART2.disabled=true
    i2 = 3
    var inte = setInterval(() => {
        document.querySelector(".aad").innerHTML = i2;
        i2--;
        if (i2 == 0) {
            clearInterval(inte);
            setTimeout(() => {
                container.classList.remove("add_displayNONE")
                pg_inscr.classList.add('add_displayNONE')
                spainer.classList.add('spainer2');
                restartINtervl();
                Question.innerHTML = Object.keys(my_object)[i]
                choi1.innerHTML = Object.values(my_object)[i][0]
                choi2.innerHTML = Object.values(my_object)[i][1]
                choi3.innerHTML = Object.values(my_object)[i][2]
            }, 1000)
        }
    }, 1000)


})



let btn_valide = document.querySelector(".btn_valide");
let popupT = document.querySelector(".popupT");
let container = document.querySelector(".container")
let input3 = document.getElementById("value-3")
let input2 = document.getElementById("value-2")
let input1 = document.getElementById("value-1")
var next_btn = document.querySelector(".next");
var next_btn2 = document.querySelector(".next2");
var arr_inputs = [input3, input2, input1]
let pg_result = document.querySelector(".pg_result")
let choi1 = document.getElementById("chois1");
let choi2 = document.getElementById("chois2");
let choi3 = document.getElementById("chois3");


let spainer = document.querySelector(".spinner");

let conter = document.querySelector(".conter");

let Question = document.querySelector(".Question");

let img_atat = document.querySelector(".etat_img");

let compter = document.querySelector(".dv2");
btn_valide.disabled = true;

window.onload = () => {
    container.classList.add("add_displayNONE")

}

btnSTART.addEventListener("click", () => {
    if (input_name_user.value.length > 4) {
        // pg_inscr.classList.add('add_displayNONE')
        pg_howto.classList.add("add_display")
        document.querySelector(".userNM").innerHTML = ' ' + input_name_user.value + ' ';
    }
    else {
        input_name_user.focus();
    }
})


let my_object = {
    'مَتَى وُلِدَ اَلنَّبِيُّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ':
        [' اَلثَّانِيَ عَشَرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ ', ' اَلْخَامِسَ عَشَرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ ', ' اَلْعَاشِرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ '],



    'مِنْ أَوَّلِ مُرْضِعَةٍ لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أُمِّهِ ؟ ':
        [' حَلِيمَة اَلسَّعْدِيَّة ', ' أُمُّ حَمْزَة ', ' ثُوَيْبَة مَوْلَاةَ أَبِي لَهَب '],



    ' كَمٌّ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ جَدِّهِ عَبْدَ اَلْمُطَّلِبْ ؟ ':
        [' عَشَرُ سَنَوَاتٍ ', ' ثَمَانٍ سَنَوَاتٍ ', ' خَمْسُ سَنَوَاتٍ '],



    ' عِنْدَمَا وَلَّدَتْ أُمُّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بِهِ ، رَأَتْ نُورًا خَرَجَ مِنْهَا فَأَضَاءَ لَهَا ':
        [' قُصُورُ اَلشَّامِ ', ' مَكَّة ', ' فَارِسُ '],



    ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ أُمِّهِ ؟ ':
        [' سَبْعُ سَنَوَاتٍ ', ' سِتُّ سَنَوَاتٍ ', ' تِسْعُ سَنَوَاتٍ '],



    ' كَمٌّ كَانَ عُمْرُ اَلنَّبِيِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ وَالِدِهِ ؟ ':
        [' سَنَةٌ وَاحِدَةٌ ', ' أَرْبَعَةُ أَشْهُرٍ ', ' مَاتَ قَبْلَ وِلَادَتِهِ '],




    ' مَا اِسْمُ أُمِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ':
        [' حَلِيمَة اَلسَّعْدِيَّة ', ' هِنْدْ بِنْتْ عُتْبَة ', ' آمِنَة بِنْتْ وَهْبْ '],




    ' مِنْ هِيَ حَاضِنَةٌ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بَعْد وَفَاةِ أُمِّهِ ؟ ':
        [' رُفَيْدَة بِنْتُ كَعْبٍ ', ' بِرْكَةُ أُمِّ أَيْمَنْ ', ' أُمٌّ سَلِيطٍ بِنْتِ عَبِيدٍ '],




    ' مَا اِسْمُ وَالِدِ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ':
        [' عَبْدُ اَللَّهْ بْنْ اَلزُّبَيْرْ ', ' أَبُو طَالِبْ ', ' عَبْدُ اَللَّهْ بْنْ عَبْدِ اَلْمُطَّلِبْ '],



    ' أَيْنَ كَانَ اَلنَّبِيُّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ يَتْحَنَثْ قَبْلُ اَلْبَعْثَةِ ؟ ':
        [' غَارُ ثَوْرٍ ', ' غَارُ حِرَاءِ ', ' غَارُ ثَوْرٍ '],



    'ما اسم الراهب الذي أخبر عم النبي صلى الله عليه وسلم أبو طالب بأن ابن أخيه - صلى الله عليه وسلم - النبي المنتظر؟':
        [' بِنْيَامِينْ ', ' بِحَيْرَى ', ' سَلَامٌ '],



    ' كَمْ كَانَ عُمَرْ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا عِنْدَمَا تَزَوَّجَتْ بِالنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ':
        [' وَاحِد وَأَرْبَعُونَ عَامًا ', ' اِثْنَانِ وَأَرْبَعُونَ عَامًا ', ' أَرْبَعُونَ عَامًّا '],



    ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ حُضُورِهِ حِلْفَ اَلْفُضُولِ ؟ ':
        [' عِشْرُونَ سَنَةً ', ' خَمْسُ وَعِشْرُونَ سَنَةً ', ' اِثْنَانِ وَعِشْرُونَ سَنَةً '],




    ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَمَا تَزَوَّجَ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا ؟ ':
        [' ثَلَاثُونَ عَامًا ', ' خَمْسُ وَعِشْرُونَ عَامًا ', ' ثَمَانٍ وَعِشْرُونَ عَامًّا '],



    ' فِي أَيِّ شَهْرٍ نَزَلَ جِبْرِيلْ عَلَيْهِ اَلسَّلَامُ بِالْقُرْآنِ عَلَى اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ':
        [' شَهْرُ رَمَضَانْ ', ' شَهْرُ شَوَّالِ ', ' شَهْرُ رَجَبْ '],



    ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلنِّسَاءِ ؟ ':
        [' جُوَيْرِيَة بِنْتْ اَلْحَارِثْ ', ' أَسْمَاءْ بِنْتْ أَبِي بَكْرْ اَلصِّدِّيقْ ', ' خَدِيجَة بِنْتْ خُوَيْلِدْ '],



    ' مِنْ هُوَ اَلَّذِي ذَهَبَتْ إِلَيْهِ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا إِلَيْهِ لِتُخْبِرهُ بِمَا حَدَثَ لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَارِ حِرَاءِ مِنْ نُزُولِ اَلْوَحْيِ ؟ ':
        [' اِبْنُ عَمِّهَا وَرَقَة بْنْ نُوفَلْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ ', ' عُمَرْ بْنْ اَلْخَطَّابْ '],



    ' كَمُّ يَوْمًا اِنْقَطَعَ اَلْوَحْيُ بَعْدَ نُزُولِهِ اَلْمَرَّةَ اَلْأُولَى عَنْ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ':
        [' عِشْرُونَ يَوْمًا ', ' أَرْبَعُونَ يَوْمًا ', ' أُسْبُوعٌ '],



    ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلصِّبْيَانِ ؟ ':
        [' عَلِي بْنْ أَبِي طَالِبْ ', ' عَبْدُ اَللَّهْ بْنْ اَلزُّبَيْرْ ', ' زَيْدْ بْنْ حَارِثَة '],



    ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلرِّجَالِ ؟ ':
        [' وَرَقَة بْنْ نُوفَلْ ', ' عُثْمَانْ بْنْ عَفَّانْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ '],



    ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلْمُوَالِي ؟ ':
        [' زَيْدْ بْنْ حَارِثَة ', ' بِلَالْ بْنْ رَبَاحْ ', ' سَلْمَانْ اَلْفَارِسِي '],



    ' مِنْ أَبْلَغَ حَمْزَة رَضِيَ اَللَّهُ عَنْهُ ، عَمُّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ، بِمَا قَالَهُ أَبُو جَهْلْ لَعْنَةِ اَللَّهِ ، لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَبٍّ وَشَتْمٍ وَتَنْقِيصٍ لِدِينِهِ ، مَا أَدَّى إِلَى إِسْلَامِهِ رَضِيَ اَللَّهُ عَنْهُ ؟ ':
        [' مُوَلَّاةً لَعَبَدَ اَللَّهِ بْنْ جُدْعَانْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ ', ' عَلِي بْنْ أَبِي طَالِبْ '],



    ' كَمٌّ كَانَتْ مُدَّةُ دَعْوَةِ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ لِلْإِسْلَامِ سِرًّا ؟ ':
        [' ثَلَاثُ سِنِينَ ', ' أَرْبَعُ سَنَوَاتٍ ', ' سَنَتَانِ '],


    ' فِي أَيِّ سَنَةٍ هَاجَرَ اَلْمُسْلِمُونَ إِلَى اَلْحَبَشَةِ ؟ ':
        [' اَلسَّنَةُ اَلْخَامِسَةُ لِلْبَعْثَةِ ', ' اَلسَّنَةُ اَلثَّانِيَةُ لِلْبَعْثَةِ ', ' اَلسَّنَةُ اَلرَّابِعَةُ لِلْبَعْثَةِ '],


    ' بِمَنْ بَعَثَتْ قُرَيْشَ إِلَى مَلِكِ اَلْحَبَشَةِ تَطْلُبُ مِنْهُ إِرْجَاعِ اَلْمُسْلِمِينَ إِلَى مَكَّةَ ؟ ':
        [' عَمْرُو بْنْ اَلْعَاصْ ، وَعَبْدْ اَللَّهِ بْنْ أُمِّيَّةٍ ', ' اَلْعَاصْ بْنْ وَائِلْ ، وَالْأُسُودُ بْنْ عَبْدِ اَلْمُطَّلِبْ ', ' اَلْأَسْوَدَ بْنْ عَبْدِ يَغُوثْ ، وَالْحَارِثَ بِمْ قَيْسْ اَلسَّهْمِي '],


    ' إِلَى أَيْنَ خَرَجَ اَلنَّبِيُّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ يَطْلُبُ اَلنُّصْرَةَ لِدِينِهِ ، بَعْدُ مَوْتِ عَمِّهِ أَبُو طَالِبْ ؟ ':
        [' اَلطَّائِفُ ', ' اَلْيَمَنُ ', ' اَلْحَبَشَةُ '], ' مَتَى أَسْلَمَ حَمْزَة بْنْ عَبْدِ اَلْمُطَّلِبْ ': [' اَلسَّنَةُ اَلسَّادِسَةُ لِلْبَعْثَةِ ',


            ' اَلسَّنَةُ اَلسَّادِيَّةُ بَعْدَ اَلْهِجْرَةِ ', ' اَلسَّنَةُ اَلثَّانِيَةُ لِلْبَعْثَةِ '], ' مَتَّىْ أَسْلَمَ عُمَرْ بْنْ اَلْخَطَّابْ ':
        [' لِسَنَةِ اَلْأُولَى مِنْ اَلْبَعْثَةِ ', ' اَلسَّنَةُ اَلرَّابِعَةُ مِنْ اَلْبَعْثَةِ ', ' اَلسَّنَةُ اَلسَّادِسَةُ مِنْ اَلْبَعْثَةِ '],


    ' مَاهِي اَلسُّورَةُ اَلَّتِي سَمِعَهَا عُمَرْ بْنْ اَلْخَطَّابْ وَكَانَتْ سَبَبًا فِي إِسْلَامِهِ ':
        [' سُورَةٌ آلَ عِمْرَانْ ', ' سُورَةُ طه ', ' سُورَةٌ اَلرَّحِمَانِ '],


    ' كَمٌّ دَامَ حِصَارُ كُفَّارَ قُرَيْشِ وَمُقَاطَعَتِهِمْ لِلْمُسْلِمِينَ ':
        [' ثَلَاثُ سَنَوَاتٍ ', ' خَمْسَةُ سَنَوَاتٍ ', ' سَنَتَانِ ']
}

arr_inputs.forEach(p => {
    p.addEventListener("click", () => {
        if (arr_inputs[0].checked == true || arr_inputs[1].checked == true || arr_inputs[2].checked == true) {
            btn_valide.disabled = false;
            window.addEventListener("keydown", (ke) => {
                if (ke.key == "Enter") {
                    btn_valide.click()
                }
            })
        }
        else {
            btn_valide.disabled = true;

        }
    })
})



istrue = true;
i = 0;
let resulta = 0;





btn_valide.addEventListener("click", () => {
    spainer.classList.remove('spainer2');
    setTimeout(() => {
        spainer.classList.add('spainer2');
    }, 10)
    restartINtervl();
    let arr_inputs2 = [
        input1.checked,
        input3.checked,
        input2.checked,
        input1.checked,
        input2.checked,
        input3.checked,
        input3.checked,
        input2.checked,
        input3.checked,
        input1.checked,
        input2.checked,
        input3.checked,
        input1.checked,
        input2.checked,
        input1.checked,
        input3.checked,
        input1.checked,
        input2.checked,
        input1.checked,
        input3.checked,
        input1.checked,
        input1.checked,
        input1.checked,
        input1.checked,
        input1.checked,
        input1.checked,
        input1.checked,
        input3.checked,
        input2.checked,
        input1.checked
    ]

    arr_inputs.forEach(p => {
        p.checked = false;
    })
    if (arr_inputs2[i]) {
        resulta += 1;
        console.log(resulta)

    }



    btn_valide.disabled = true;
    if (i < Object.keys(my_object).length - 1) {
        i++
        Question.innerHTML = Object.keys(my_object)[i]
        choi1.innerHTML = Object.values(my_object)[i][0]
        choi2.innerHTML = Object.values(my_object)[i][1]
        choi3.innerHTML = Object.values(my_object)[i][2]
    }

    else {
        container2.classList.add("add_displayNONE")
        document.querySelector(".user_Anme").innerHTML = `${input_name_user.value} : السيد `;
        document.querySelector(".no9").innerHTML = `${resulta}/30`;
        if (resulta <= 10) {
            document.querySelector(".miz").innerHTML = "متوسط "
        }

        if (resulta > 10 && resulta <= 20) {
            document.querySelector(".miz").innerHTML = "حسن"
        }

        if (resulta > 20) {
            document.querySelector(".miz").innerHTML = "حسن جدا"
        }
        pg_result.classList.add("add_display");
    }




})



next_btn2.addEventListener("click", () => {
    popupT.classList.remove("add_display");
    spainer.classList.remove('spainer2');

    setTimeout(() => {
        spainer.classList.add('spainer2');
    }, 10)

    restartINtervl();

    // let arr_inputs2 = [
    //     input1.checked,
    //     input3.checked,
    //     input2.checked,
    //     input1.checked,
    //     input2.checked,
    //     input3.checked,
    //     input3.checked,
    //     input2.checked,
    //     input3.checked,
    //     input1.checked,
    //     input2.checked,
    //     input3.checked,
    //     input1.checked,
    //     input2.checked,
    //     input1.checked,
    //     input3.checked,
    //     input1.checked,
    //     input2.checked,
    //     input1.checked,
    //     input3.checked,
    //     input1.checked,
    //     input1.checked,
    //     input1.checked,
    //     input1.checked,
    //     input1.checked,
    //     input1.checked,
    //     input1.checked,
    //     input3.checked,
    //     input2.checked,
    //     input1.checked,
    //     input3.checked
    // ]

    arr_inputs.forEach(p => {
        p.checked = false;
    })

    // if (arr_inputs2[i]) {
    //     resulta += 1;
    //     console.log(resulta)

    // }

    btn_valide.disabled = true;

    if (i < Object.keys(my_object).length - 1) {
        i++
        Question.innerHTML = Object.keys(my_object)[i]
        choi1.innerHTML = Object.values(my_object)[i][0]
        choi2.innerHTML = Object.values(my_object)[i][1]
        choi3.innerHTML = Object.values(my_object)[i][2]
    }

    else if (i > Object.keys(my_object).length) {
        container2.classList.remove("add_display")
        document.querySelector(".no9").innerHTML = `${resulta}/30`;
        document.querySelector(".user_Anme").innerHTML = `${input_name_user} : السيد `;
        if (resulta <= 10) {
            document.querySelector(".miz").innerHTML = "متوسط "
        }

        if (resulta > 10 && resulta <= 20) {
            document.querySelector(".miz").innerHTML = "حسن"
        }

        if (resulta > 20) {
            document.querySelector(".miz").innerHTML = "حسن جدا"
        }
        pg_result.classList.add("add_display");
    }
})




function restartINtervl() {
    let b = 29;
    let time_conterv = setInterval(time_conter, 1000)
    function time_conter() {
        if (b == 0) {
            conter.innerHTML = b;
            popupT.classList.add("add_display");
            spainer.classList.remove('spainer2');
            clearInterval(time_conterv)
        }
        btn_valide.onclick = () => {
            clearInterval(time_conterv)
        }

        conter.innerHTML = b;
        b--;

    }
}

// console.log('hw;p')






















globalThis.arr_ijabat = [
    // input1.checked,
    // input3.checked,
    // input2.checked,
    // input1.checked,
    // input2.checked,
    // input3.checked,
    // input3.checked,
    // input1.checked,
    // input2.checked,
    // input2.checked,
    // input3.checked,
    // input1.checked,
    // input2.checked,
    // input1.checked,
    // input3.checked,
    // input1.checked,
    // input2.checked,
    // input1.checked,
    // input3.checked,
    // input1.checked,
    // input1.checked,
    // input2.checked,
    // input1.checked,
    // input1.checked,
    // input1.checked,
    // input1.checked,
    // input2.checked,
    // input1.checked,
    // input1.checked,
    // input1.checked,
    // input1.checked
];




let arr_question = [
    // ' مَتَى وُلِدَ اَلنَّبِيُّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ',
    // ' مِنْ أَوَّلِ مُرْضِعَةٍ لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أُمِّهِ ؟ ',
    // ' كَمٌّ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ جَدِّهِ عَبْدَ اَلْمُطَّلِبْ ؟ ',
    // ' عِنْدَمَا وَلَّدَتْ أُمُّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بِهِ ، رَأَتْ نُورًا خَرَجَ مِنْهَا فَأَضَاءَ لَهَا ',
    // ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ أُمِّهِ ؟ ',
    // ' كَمٌّ كَانَ عُمْرُ اَلنَّبِيِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاةِ وَالِدِهِ ؟ '
    // ' مَا اِسْمُ أُمِّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ',
    // ' مِنْ هِيَ حَاضِنَةٌ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ بَعْد وَفَاةِ أُمِّهِ ؟ ',
    // ' مَا اِسْمُ وَالِدِ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ',
    // ' أَيْنَ كَانَ اَلنَّبِيُّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ يَتْحَنَثْ قَبْلُ اَلْبَعْثَةِ ؟ ',
    // 'ما اسم الراهب الذي أخبر عم النبي صلى الله عليه وسلم أبو طالب بأن ابن أخيه - صلى الله عليه وسلم - النبي المنتظر؟',
    // ' كَمْ كَانَ عُمَرْ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا عِنْدَمَا تَزَوَّجَتْ بِالنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ',
    // ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ حُضُورِهِ حِلْفَ اَلْفُضُولِ ؟ ',
    // ' كَمْ كَانَ عُمْرُ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَمَا تَزَوَّجَ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا ؟ ',
    // ' فِي أَيِّ شَهْرٍ نَزَلَ جِبْرِيلْ عَلَيْهِ اَلسَّلَامُ بِالْقُرْآنِ عَلَى اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ',
    // ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلنِّسَاءِ ؟ ',
    // ' مِنْ هُوَ اَلَّذِي ذَهَبَتْ إِلَيْهِ خَدِيجَة رَضِيَ اَللَّهُ عَنْهَا إِلَيْهِ لِتُخْبِرهُ بِمَا حَدَثَ لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَارِ حِرَاءِ مِنْ نُزُولِ اَلْوَحْيِ ؟ ',
    // ' كَمُّ يَوْمًا اِنْقَطَعَ اَلْوَحْيُ بَعْدَ نُزُولِهِ اَلْمَرَّةَ اَلْأُولَى عَنْ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ؟ ',
    // ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلصِّبْيَانِ ؟ ',
    // ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلرِّجَالِ ؟ ',
    // ' مِنْ أَوَّلِ مِنْ أَسْلَمَ مِنْ اَلْمُوَالِي ؟ ',
    // ' مِنْ أَبْلَغَ حَمْزَة رَضِيَ اَللَّهُ عَنْهُ ، عَمُّ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ ، بِمَا قَالَهُ أَبُو جَهْلْ لَعْنَةِ اَللَّهِ ، لِلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَبٍّ وَشَتْمٍ وَتَنْقِيصٍ لِدِينِهِ ، مَا أَدَّى إِلَى إِسْلَامِهِ رَضِيَ اَللَّهُ عَنْهُ ؟ ',
    // ' كَمٌّ كَانَتْ مُدَّةُ دَعْوَةِ اَلنَّبِيِّ صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ لِلْإِسْلَامِ سِرًّا ؟ ',
    // 'في أي سنة هاجر المسلمون إلى الحبشة؟',
    // 'بمن بعثت قريش إلى ملك الحبشة تطلب منه إرجاع المسلمين إلى مكة؟',
    // 'إلى أين خرج النبي صلى الله عليه وسلم يطلب النصرة لدينه، بعد موت عمه أبو طالب؟',
    // 'متى اسلم حمزة بن عبد المطلب',
    // 'متى اسلم عمر بن الخطاب',
    // 'ماهي السورة التي سمعها عمر بن الخطاب وكانت سببا في إسلامه',
    // 'كم دام حصار كفار قريش ومقاطعتهم للمسلمين',
    // 'كم دامت الدعوة النبوية في المرحلة المكية'
];


let obj_chois = [
    // [' اَلثَّانِيَ عَشَرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ ', ' اَلْخَامِسَ عَشَرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ ', ' اَلْعَاشِرَ مِنْ رَبِيعْ اَلْأَوَّلِ ، عَامُ اَلْفِيلَ '],
    // [' حَلِيمَة اَلسَّعْدِيَّة ', ' أُمُّ حَمْزَة ', ' ثُوَيْبَة مَوْلَاةَ أَبِي لَهَب '],
    // [' عَشَرُ سَنَوَاتٍ ', ' ثَمَانٍ سَنَوَاتٍ ', ' خَمْسُ سَنَوَاتٍ '],
    // [' قُصُورُ اَلشَّامِ ', ' مَكَّة ', ' فَارِسُ '],
    // [' سَبْعُ سَنَوَاتٍ ', ' سِتُّ سَنَوَاتٍ ', ' تِسْعُ سَنَوَاتٍ '],

    // [' سَنَةٌ وَاحِدَةٌ ', ' أَرْبَعَةُ أَشْهُرٍ ', ' مَاتَ قَبْلَ وِلَادَتِهِ '],

    // [' حَلِيمَة اَلسَّعْدِيَّة ', ' هِنْدْ بِنْتْ عُتْبَة ', ' آمِنَة بِنْتْ وَهْبْ '],

    // [' رُفَيْدَة بِنْتُ كَعْبٍ ', ' بِرْكَةُ أُمِّ أَيْمَنْ ', ' أُمٌّ سَلِيطٍ بِنْتِ عَبِيدٍ '],

    // [' عَبْدُ اَللَّهْ بْنْ اَلزُّبَيْرْ ', ' أَبُو طَالِبْ ', ' عَبْدُ اَللَّهْ بْنْ عَبْدِ اَلْمُطَّلِبْ '],

    // [' غَارُ ثَوْرٍ ', ' غَارُ حِرَاءِ ', ' غَارُ ثَوْرٍ '],

    // [' بِنْيَامِينْ ', ' بِحَيْرَى ', ' سَلَامٌ '],
    // [' وَاحِد وَأَرْبَعُونَ عَامًا ', ' اِثْنَانِ وَأَرْبَعُونَ عَامًا ', ' أَرْبَعُونَ عَامًّا '],
    // [' عِشْرُونَ سَنَةً ', ' خَمْسُ وَعِشْرُونَ سَنَةً ', ' اِثْنَانِ وَعِشْرُونَ سَنَةً '],
    // [' ثَلَاثُونَ عَامًا ', ' خَمْسُ وَعِشْرُونَ عَامًا ', ' ثَمَانٍ وَعِشْرُونَ عَامًّا '],
    // [' شَهْرُ رَمَضَانْ ', ' شَهْرُ شَوَّالِ ', ' شَهْرُ رَجَبْ '],
    // [' جُوَيْرِيَة بِنْتْ اَلْحَارِثْ ', ' أَسْمَاءْ بِنْتْ أَبِي بَكْرْ اَلصِّدِّيقْ ', ' خَدِيجَة بِنْتْ خُوَيْلِدْ '],
    // [' اِبْنُ عَمِّهَا وَرَقَة بْنْ نُوفَلْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ ', ' عُمَرْ بْنْ اَلْخَطَّابْ '],
    // [' عِشْرُونَ يَوْمًا ', ' أَرْبَعُونَ يَوْمًا ', ' أُسْبُوعٌ '],
    // [' عَلِي بْنْ أَبِي طَالِبْ ', ' عَبْدُ اَللَّهْ بْنْ اَلزُّبَيْرْ ', ' زَيْدْ بْنْ حَارِثَة '],
    // [' وَرَقَة بْنْ نُوفَلْ ', ' عُثْمَانْ بْنْ عَفَّانْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ '],
    // [' زَيْدْ بْنْ حَارِثَة ', ' بِلَالْ بْنْ رَبَاحْ ', ' سَلْمَانْ اَلْفَارِسِي '],
    // [' مُوَلَّاةً لَعَبَدَ اَللَّهِ بْنْ جُدْعَانْ ', ' أَبُو بَكْرْ اَلصِّدِّيقْ ', ' عَلِي بْنْ أَبِي طَالِبْ '],
    // [' ثَلَاثُ سِنِينَ ', ' أَرْبَعُ سَنَوَاتٍ ', ' سَنَتَانِ '],
    // ['السنة الخامسة للبعثة', 'السنة الثانية للبعثة', 'السنة الرابعة للبعثة'],
    // ['عمرو بن العاص، وعبد الله بن أمية', 'العاص بن وائل، والأسود بن عبد المطلب', 'الأسود بن عبد يغوث، والحارث بم قيس السهمي'],
    // ['الطائف', 'اليمن', 'الحبشة'],
    // ['السنة السادسة للبعثة ', 'السنة السادية بعد الهجرة ', 'السنة الثانية للبعثة'],
    // ['لسنة الأولى من البعثة', 'السنة الرابعة من البعثة', 'السنة السادسة من البعثة '],
    // ['سورة ال عمران', 'سورة طه', 'سورة الرحمان'],
    // ['ثلاث سنوات', 'خمسة سنوات', 'سنتان'],
    // ['عشر سنوات', 'إحدى عشر سنة', 'ثلاث عشرة سنة',]
];